In [23]:
# IMDB2SQL
# we're taking the IMDB data and converting it to SQL tables
# along the way, doing some data cleaning and manipulation
# goal here is to have a database that is minimal for the purpose of the project
# project is to replicate oracle of bacon
# so we only need movies, actors, and the relationships between them
import pandas as pd

# import name.basics.tsv
name_basics = pd.read_csv('name.basics.tsv', sep='\t')

print("nconst is unique: ", name_basics['nconst'].is_unique)
# re-index on nconst
name_basics.set_index('nconst', inplace=True)
# make all columns lowercase
name_basics.columns = name_basics.columns.str.lower()
# random sample
name_basics.sample(5)

nconst is unique:  True

,primaryname,birthyear,deathyear,primaryprofession,knownfortitles
nconst,,,,,
nm5041339,Edgar Araiza,\N,\N,actor,tt2138947
nm12738563,Alyssa Smith,\N,\N,writer,tt14187980
nm15349805,Logan Richards,\N,\N,music_department,tt29474242
nm1038033,Ted Moskowitz,\N,\N,"camera_department,cinematographer","tt4538720,tt0060007,tt0204767,tt0151621"
nm14337708,Rd Bishop,\N,\N,"director,writer,producer","tt27788436,tt24328670"

In [24]:
# EDAs
# find all entries with \N in any column and set to NaN
name_basics = name_basics.replace('\\N', pd.NA)
# count missing values
name_basics.describe(include='all')

       primaryname birthyear deathyear primaryprofession knownfortitles
count     13779152    624696    233853          11116963       12236455
unique    10594057       542       484             22999        5748263
top           Alex      1980      2021             actor      tt0123338
freq           512     10067      7429           2448369           8289

In [25]:
# change birthyear and deathyear to int
name_basics['birthyear'] = pd.to_numeric(name_basics['birthyear'], errors='coerce')
name_basics['deathyear'] = pd.to_numeric(name_basics['deathyear'], errors='coerce')
name_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 13779210 entries, nm0000001 to nm9993719
Data columns (total 5 columns):
 #   Column             Dtype
---  ------             -----
 0   primaryname        object
 1   birthyear          float64
 2   deathyear          float64
 3   primaryprofession  object
 4   knownfortitles     object
dtypes: float64(2), object(3)
memory usage: 630.8+ MB

In [26]:
# import title.basics.tsv
title_basics = pd.read_csv('title.basics.tsv', sep='\t')
title_basics = title_basics.replace('\\N', pd.NA)
# check if tconst is unique and print the result 
print("tconst is unique: ", title_basics['tconst'].is_unique)
# set columns to lowercase
title_basics.columns = title_basics.columns.str.lower()
# set index to tconst
title_basics.set_index('tconst', inplace=True)
title_basics.sample(5)

C:\Users\Dave\AppData\Local\Temp\ipykernel_16996\4141869235.py:2: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  title_basics = pd.read_csv('title.basics.tsv', sep='\t')

tconst is unique:  True

,titletype,primarytitle,originaltitle,isadult,startyear,endyear,runtimeminutes,genres
tconst,,,,,,,,
tt0402651,tvMiniSeries,The Hill of the Red Fox,The Hill of the Red Fox,0,1975,<NA>,150,Thriller
tt31719951,tvSeries,Outlier,Outlier,0,2025,<NA>,<NA>,Animation
tt13892460,tvEpisode,Episode #1.275,Episode #1.275,0,2018,<NA>,<NA>,Game-Show
tt5829098,tvEpisode,Job Killers,Job Killers,0,2011,<NA>,42,News
tt6046218,tvEpisode,Juatasha Denton-McCaster,Juatasha Denton-McCaster,0,2015,<NA>,43,"Crime,Documentary"

In [27]:
# convert certain columns to numeric
title_basics['startyear'] = pd.to_numeric(title_basics['startyear'], errors='coerce')
title_basics['endyear'] = pd.to_numeric(title_basics['endyear'], errors='coerce')
title_basics['runtimeminutes'] = pd.to_numeric(title_basics['runtimeminutes'], errors='coerce')
title_basics['isadult'] = pd.to_numeric(title_basics['isadult'], errors='coerce')
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11059690 entries, tt0000001 to tt9916880
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   titletype       object
 1   primarytitle    object
 2   originaltitle   object
 3   isadult         float64
 4   startyear       float64
 5   endyear         float64
 6   runtimeminutes  float64
 7   genres          object
dtypes: float64(4), object(4)
memory usage: 759.4+ MB

In [28]:
# quick sanity check
title_basics.sample(5)

,titletype,primarytitle,originaltitle,isadult,startyear,endyear,runtimeminutes,genres
tconst,,,,,,,,
tt28656512,tvEpisode,L'éviction / L'abonnée au 911,L'éviction / L'abonnée au 911,0.0,2022.0,NaN,NaN,Reality-TV
tt13308892,tvSpecial,Yo Just Say VOTE!,Yo Just Say VOTE!,0.0,2020.0,NaN,60.0,Short
tt1601622,tvSeries,Margene's Blog,Margene's Blog,0.0,2010.0,NaN,25.0,Drama
tt4037068,tvEpisode,Episode #1.3455,Episode #1.3455,0.0,1983.0,NaN,43.0,"Drama,Mystery,Romance"
tt7483552,tvEpisode,Jai's decision puts Kumkum in a dilemma,Jai's decision puts Kumkum in a dilemma,0.0,NaN,NaN,NaN,Family

In [29]:
# import title.principals.tsv
title_principals = pd.read_csv('title.principals.tsv', sep='\t')
title_principals = title_principals.replace('\\N', pd.NA)
print("tconst is unique: ", title_principals['tconst'].is_unique)
# set columns to lowercase
title_principals.columns = title_principals.columns.str.lower()
title_principals.head(25)

tconst is unique:  False

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,<NA>,"[""Self""]"
1,tt0000001,2,nm0005690,director,<NA>,<NA>
2,tt0000001,3,nm0005690,producer,producer,<NA>
3,tt0000001,4,nm0374658,cinematographer,director of photography,<NA>
4,tt0000002,1,nm0721526,director,<NA>,<NA>
5,tt0000002,2,nm1335271,composer,<NA>,<NA>
6,tt0000003,1,nm0721526,director,<NA>,<NA>
7,tt0000003,2,nm1770680,producer,producer,<NA>
8,tt0000003,3,nm0721526,producer,producer,<NA>
9,tt0000003,4,nm1335271,composer,<NA>,<NA>
10,tt0000003,5,nm5442200,editor,editor,<NA>
11,tt0000004,1,nm0721526,director,<NA>,<NA>
12,tt0000004,2,nm1335271,composer,<NA>,<NA>
13,tt0000005,1,nm0443482,actor,<NA>,"[""Blacksmith""]"
14,tt0000005,2,nm0653042,actor,<NA>,"[""Assistant""]"
15,tt0000005,3,nm0249379,producer,producer,<NA>
16,tt0000007,1,nm0179163,actor,<NA>,<NA>
17,tt0000007,2,nm0183947,actor,<NA>,<NA>
18,tt0000007,3,nm0005690,director,<NA>,<NA>
19,tt0000007,4,nm0374658,director,<NA>,<NA>
20,tt0000007,5,nm0005690,producer,producer,<NA>
21,tt0000007,6,nm0249379,producer,producer,<NA>
22,tt0000007,7,nm0374658,cinematographer,<NA>,<NA>
23,tt0000008,1,nm0653028,actor,<NA>,"[""Sneezing Man""]"
24,tt0000008,2,nm0005690,director,<NA>,<NA>

In [30]:
title_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87799799 entries, 0 to 87799798
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   tconst      object
 1   ordering    int64
 2   nconst      object
 3   category    object
 4   job         object
 5   characters  object
dtypes: int64(1), object(5)
memory usage: 3.9+ GB

In [31]:
# import title.ratings.tsv
title_ratings = pd.read_csv('title.ratings.tsv', sep='\t')
title_ratings = title_ratings.replace('\\N', pd.NA)
print("tconst is unique: ", title_ratings['tconst'].is_unique)
# set columns to lowercase
title_ratings.columns = title_ratings.columns.str.lower()
# re-index on tconst
title_ratings.set_index('tconst', inplace=True)
title_ratings.sample(5)

tconst is unique:  True

           averagerating  numvotes
tconst
tt1735502            9.0         6
tt0285633            7.0        12
tt6117478            6.8        15
tt1577300            7.2       179
tt3151026            6.2         6

In [32]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1474118 entries, tt0000001 to tt9916880
Data columns (total 2 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   averagerating  1474118 non-null  float64
 1   numvotes       1474118 non-null  int64
dtypes: float64(1), int64(1)
memory usage: 33.7+ MB

In [33]:
# import title.crew.tsv
title_crew = pd.read_csv('title.crew.tsv', sep='\t')
title_crew = title_crew.replace('\\N', pd.NA)
print("tconst is unique: ", title_crew['tconst'].is_unique)

# set columns to lowercase
title_crew.columns = title_crew.columns.str.lower()

# re-index on tconst
title_crew.set_index('tconst', inplace=True)
title_crew.sample(5)

tconst is unique:  True

             directors                           writers
tconst
tt3395746    nm6144336               nm4455031,nm6144336
tt15343572  nm11467484    nm5704133,nm9957701,nm12330168
tt26941417  nm10212410  nm12368469,nm10212410,nm14615072
tt10635980   nm6918590                         nm6918590
tt4213228    nm6916154                         nm6916151

In [34]:
# import title.akas.tsv
title_akas = pd.read_csv('title.akas.tsv', sep='\t')
title_akas = title_akas.replace('\\N', pd.NA)


# set columns to lowercase
title_akas.columns = title_akas.columns.str.lower()
print("tconst is unique: ", title_akas['titleid'].is_unique)
title_akas.sample(5)

tconst is unique:  False

,titleid,ordering,title,region,language,types,attributes,isoriginaltitle
41180469,tt5682868,3,एपिसोड #1.825,IN,hi,<NA>,<NA>,0
44595305,tt7632430,3,एपिसोड #1.414,IN,hi,<NA>,<NA>,0
34086523,tt30743324,7,2024年1月6日 のエピソード,JP,ja,<NA>,<NA>,0
7266540,tt11212536,3,एपिसोड #1.16,IN,hi,<NA>,<NA>,0
21759516,tt1815301,3,एपिसोड #2.101,IN,hi,<NA>,<NA>,0

In [35]:
title_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49556194 entries, 0 to 49556193
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleid          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isoriginaltitle  int64
dtypes: int64(2), object(6)
memory usage: 3.0+ GB

In [36]:
title_akas.head(5)

,titleid,ordering,title,region,language,types,attributes,isoriginaltitle
0,tt0000001,1,Carmencita,<NA>,<NA>,original,<NA>,1
1,tt0000001,2,Carmencita,DE,<NA>,<NA>,literal title,0
2,tt0000001,3,Carmencita,US,<NA>,imdbDisplay,<NA>,0
3,tt0000001,4,Carmencita - spanyol tánc,HU,<NA>,imdbDisplay,<NA>,0
4,tt0000001,5,Καρμενσίτα,GR,<NA>,imdbDisplay,<NA>,0

In [37]:
# import title.episode.tsv
title_episode = pd.read_csv('title.episode.tsv', sep='\t')
title_episode = title_episode.replace('\\N', pd.NA)

In [38]:
# set columns to lowercase
title_episode.columns = title_episode.columns.str.lower()
print (title_episode.columns)
print("tconst is unique: ", title_episode['tconst'].is_unique)


# re-index on tconst
title_episode.set_index('tconst', inplace=True)
title_episode.sample(5)

Index(['tconst', 'parenttconst', 'seasonnumber', 'episodenumber'], dtype='object')
tconst is unique:  True

           parenttconst seasonnumber episodenumber
tconst
tt4780030     tt4760934            1             7
tt16268738    tt0092350            1           113
tt33333673    tt0198171            1           118
tt13386392    tt2224968            1            24
tt1898175     tt0356232         <NA>          <NA>

In [39]:
# set seasonNumber and episodeNumber to numeric
title_episode['seasonnumber'] = pd.to_numeric(title_episode['seasonnumber'], errors='coerce')
title_episode['episodenumber'] = pd.to_numeric(title_episode['episodenumber'], errors='coerce')
title_episode.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8480573 entries, tt0031458 to tt9916880
Data columns (total 3 columns):
 #   Column         Dtype
---  ------         -----
 0   parenttconst   object
 1   seasonnumber   float64
 2   episodenumber  float64
dtypes: float64(2), object(1)
memory usage: 258.8+ MB

In [41]:
# go through all 7 dataframes and list the columns just to be sure before we write this to SQL
print(name_basics.info())
print(title_basics.info())
print(title_principals.info())
print(title_ratings.info())
print(title_crew.info())
print(title_akas.info())
print(title_episode.info())

<class 'pandas.core.frame.DataFrame'>
Index: 13779210 entries, nm0000001 to nm9993719
Data columns (total 5 columns):
 #   Column             Dtype
---  ------             -----
 0   primaryname        object
 1   birthyear          float64
 2   deathyear          float64
 3   primaryprofession  object
 4   knownfortitles     object
dtypes: float64(2), object(3)
memory usage: 630.8+ MB
None
<class 'pandas.core.frame.DataFrame'>
Index: 11059690 entries, tt0000001 to tt9916880
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   titletype       object
 1   primarytitle    object
 2   originaltitle   object
 3   isadult         float64
 4   startyear       float64
 5   endyear         float64
 6   runtimeminutes  float64
 7   genres          object
dtypes: float64(4), object(4)
memory usage: 759.4+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87799799 entries, 0 to 87799798
Data columns (total 6 columns):
 #   Column      Dtype
---  ------      -----
 0   tconst      object
 1   ordering    int64
 2   nconst      object
 3   category    object
 4   job         object
 5   characters  object
dtypes: int64(1), object(5)
memory usage: 3.9+ GB
None
<class 'pandas.core.frame.DataFrame'>
Index: 1474118 entries, tt0000001 to tt9916880
Data columns (total 2 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   averagerating  1474118 non-null  float64
 1   numvotes       1474118 non-null  int64
dtypes: float64(1), int64(1)
memory usage: 33.7+ MB
None
<class 'pandas.core.frame.DataFrame'>
Index: 10401681 entries, tt0000001 to tt9916880
Data columns (total 2 columns):
 #   Column     Dtype
---  ------     -----
 0   directors  object
 1   writers    object
dtypes: object(2)
memory usage: 238.1+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49556194 entries, 0 to 49556193
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleid          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isoriginaltitle  int64
dtypes: int64(2), object(6)
memory usage: 3.0+ GB
None
<class 'pandas.core.frame.DataFrame'>
Index: 8480573 entries, tt0031458 to tt9916880
Data columns (total 3 columns):
 #   Column         Dtype
---  ------         -----
 0   parenttconst   object
 1   seasonnumber   float64
 2   episodenumber  float64
dtypes: float64(2), object(1)
memory usage: 258.8+ MB
None

In [42]:
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost/imdb_pg')

In [43]:
name_basics.to_sql('name_basics', engine, index=True, if_exists='replace')
print('name_basics done')

In [20]:
title_basics.to_sql('title_basics', engine, index=True, if_exists='replace')
print('title_basics done')

title_basics done

In [21]:
title_ratings.to_sql('title_ratings', engine, index=True, if_exists='replace')
print('title_ratings done')

title_ratings done

In [22]:
title_crew.to_sql('title_crew', engine, index=True, if_exists='replace')
print('title_crew done')

title_crew done

In [23]:
title_akas.to_sql('title_akas', engine, index=True, if_exists='replace')
print('title_akas done')

title_episode.to_sql('title_episode', engine, index=True, if_exists='replace')
print('title_episode done')

title_akas done
title_episode done

In [24]:
# ok now do the same for the other dataframes
title_principals.to_sql('title_principals', engine, index=True, if_exists='replace')
print('title_principals done')

title_principals done

In [ ]:

# now dispose of the engine
engine.dispose()